TMS320C6x COFF Assembler PC v5.1.0 Sun Mar 12 21:25:04 2006

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\Ga&Lu\IMPOST~1\Temp\TI06010                              PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Sun Mar 12 21:25:03 2006                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far_aggregates --quiet -
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C671x                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1366                    DW$T$47 .dwtag  DW_TAG_subroutine_type
    1367                            .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
    1368                    DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
    1369                            .dwendtag DW$T$47
    1370                    
    1371                    
    1372                    DW$T$49 .dwtag  DW_TAG_subroutine_type
    1373                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    1374                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1375                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1376                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    1377                    
    1378                    DW$T$54 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1379                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1380                    DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
    1381                    DW$96   .dwtag  DW_TAG_unspecified_parameters
    1382                            .dwendtag DW$T$54
    1383                    
    1384                    
    1385                    DW$T$56 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1386                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1387                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1388                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1389                    
    1390                    DW$T$58 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1391                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    1392                    DW$97   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
    1393                            .dwendtag DW$T$58
    1394                    
    1395                    
    1396                    DW$T$61 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1397                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1398                    DW$98   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$60)
    1399                    DW$99   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
TMS320C6x COFF Assembler PC v5.1.0 Sun Mar 12 21:25:04 2006

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\Ga&Lu\IMPOST~1\Temp\TI06010                              PAGE   27

    1400                    DW$100  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1401                            .dwendtag DW$T$61
    1402                    
    1403                    
    1404                    DW$T$64 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
    1405                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    1406                            .dwattr DW$T$64, DW_AT_byte_size(0x10000)
    1407                    DW$101  .dwtag  DW_TAG_subrange_type
    1408                            .dwattr DW$101, DW_AT_upper_bound(0x7f)
    1409                    DW$102  .dwtag  DW_TAG_subrange_type
    1410                            .dwattr DW$102, DW_AT_upper_bound(0x7f)
    1411                            .dwendtag DW$T$64
    1412                    
    1413                    DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    1414                            .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    1415                            .dwattr DW$T$16, DW_AT_byte_size(0x04)
    1416                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_Handle"), DW_AT_type(*DW$T$27)
    1417                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1418                    
    1419                    DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$28)
    1420                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    1421                    DW$103  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1422                    DW$104  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1423                            .dwendtag DW$T$70
    1424                    
    1425                    DW$T$46 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
    1426                            .dwattr DW$T$46, DW_AT_address_class(0x20)
    1427                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("Complex"), DW_AT_type(*DW$T$32)
    1428                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1429                    DW$T$72 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$60)
    1430                            .dwattr DW$T$72, DW_AT_address_class(0x20)
    1431                    DW$T$53 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
    1432                            .dwattr DW$T$53, DW_AT_address_class(0x20)
    1433                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1434                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1435                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1436                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    1437                            .dwattr DW$T$27, DW_AT_address_class(0x20)
    1438                    DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("_CSL_Config"), DW_AT_type(*DW$T$31)
    1439                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    1440                    
    1441                    DW$T$32 .dwtag  DW_TAG_structure_type
    1442                            .dwattr DW$T$32, DW_AT_name("ComplexTag")
    1443                            .dwattr DW$T$32, DW_AT_byte_size(0x08)
    1444                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1445                            .dwattr DW$105, DW_AT_name("R"), DW_AT_symbol_name("_R")
    1446                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1448                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    1449                            .dwattr DW$106, DW_AT_name("I"), DW_AT_symbol_name("_I")
    1450                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1451                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1452                            .dwendtag DW$T$32
    1453                    
    1454                    DW$T$52 .dwtag  DW_TAG_const_type
TMS320C6x COFF Assembler PC v5.1.0 Sun Mar 12 21:25:04 2006

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\Ga&Lu\IMPOST~1\Temp\TI06010                              PAGE   28

    1455                            .dwattr DW$T$52, DW_AT_type(*DW$T$51)
    1456                    
    1457                    DW$T$22 .dwtag  DW_TAG_structure_type
    1458                            .dwattr DW$T$22, DW_AT_byte_size(0x0c)
    1459                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1460                            .dwattr DW$107, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1461                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1463                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1464                            .dwattr DW$108, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1465                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1466                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1467                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1468                            .dwattr DW$109, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1469                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1470                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1471                            .dwendtag DW$T$22
    1472                    
    1473                    
    1474                    DW$T$31 .dwtag  DW_TAG_union_type
    1475                            .dwattr DW$T$31, DW_AT_byte_size(0x10)
    1476                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1477                            .dwattr DW$110, DW_AT_name("args"), DW_AT_symbol_name("_args")
    1478                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1480                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1481                            .dwattr DW$111, DW_AT_name("ret"), DW_AT_symbol_name("_ret")
    1482                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1484                            .dwendtag DW$T$31
    1485                    
    1486                    DW$T$51 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1487                            .dwattr DW$T$51, DW_AT_encoding(DW_ATE_signed_char)
    1488                            .dwattr DW$T$51, DW_AT_byte_size(0x01)
    1489                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    1490                            .dwattr DW$T$21, DW_AT_address_class(0x20)
    1491                    
    1492                    DW$T$26 .dwtag  DW_TAG_structure_type
    1493                            .dwattr DW$T$26, DW_AT_byte_size(0x10)
    1494                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1495                            .dwattr DW$112, DW_AT_name("biosPresent"), DW_AT_symbol_name("_biosPresent")
    1496                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1498                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1499                            .dwattr DW$113, DW_AT_name("dispatchTable"), DW_AT_symbol_name("_dispatchTable")
    1500                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1501                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1502                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1503                            .dwattr DW$114, DW_AT_name("timerUsed"), DW_AT_symbol_name("_timerUsed")
    1504                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1505                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1506                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1507                            .dwattr DW$115, DW_AT_name("timerNum"), DW_AT_symbol_name("_timerNum")
    1508                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1509                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Sun Mar 12 21:25:04 2006

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\Ga&Lu\IMPOST~1\Temp\TI06010                              PAGE   29

    1510                            .dwendtag DW$T$26
    1511                    
    1512                    
    1513                    DW$T$30 .dwtag  DW_TAG_structure_type
    1514                            .dwattr DW$T$30, DW_AT_byte_size(0x0c)
    1515                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1516                            .dwattr DW$116, DW_AT_name("hTimer"), DW_AT_symbol_name("_hTimer")
    1517                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1519                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1520                            .dwattr DW$117, DW_AT_name("event2IntTbl"), DW_AT_symbol_name("_event2IntTbl")
    1521                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1522                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1523                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1524                            .dwattr DW$118, DW_AT_name("int2EventTbl"), DW_AT_symbol_name("_int2EventTbl")
    1525                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1526                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwendtag DW$T$30
    1528                    
    1529                    DW$T$20 .dwtag  DW_TAG_volatile_type
    1530                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
    1531                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
    1532                            .dwattr DW$T$29, DW_AT_address_class(0x20)
    1533                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1534                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    1535                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("_IRQ_Dispatch"), DW_AT_type(*DW$T$23)
    1536                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1537                    
    1538                    DW$T$23 .dwtag  DW_TAG_structure_type
    1539                            .dwattr DW$T$23, DW_AT_byte_size(0x10)
    1540                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1541                            .dwattr DW$119, DW_AT_name("funcAddr"), DW_AT_symbol_name("_funcAddr")
    1542                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1543                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1544                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1545                            .dwattr DW$120, DW_AT_name("ieMask"), DW_AT_symbol_name("_ieMask")
    1546                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1547                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1548                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1549                            .dwattr DW$121, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
    1550                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1551                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1552                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1553                            .dwattr DW$122, DW_AT_name("funcArg"), DW_AT_symbol_name("_funcArg")
    1554                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1555                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1556                            .dwendtag DW$T$23
    1557                    
    1558                    
    1559                            .dwattr DW$83, DW_AT_external(0x01)
    1560                            .dwattr DW$84, DW_AT_external(0x01)
    1561                            .dwattr DW$46, DW_AT_external(0x01)
    1562                            .dwattr DW$57, DW_AT_external(0x01)
    1563                            .dwattr DW$65, DW_AT_external(0x01)
    1564                            .dwattr DW$65, DW_AT_type(*DW$T$19)
TMS320C6x COFF Assembler PC v5.1.0 Sun Mar 12 21:25:04 2006

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\Ga&Lu\IMPOST~1\Temp\TI06010                              PAGE   30

    1565                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1566                    
    1567                    ;***************************************************************
    1568                    ;* DWARF CIE ENTRIES                                           *
    1569                    ;***************************************************************
    1570                    
    1571                    DW$CIE  .dwcie 1, 126
    1572                            .dwcfa  0x0c, 31, 0
    1573                            .dwcfa  0x07, 0
    1574                            .dwcfa  0x07, 1
    1575                            .dwcfa  0x07, 2
    1576                            .dwcfa  0x07, 3
    1577                            .dwcfa  0x07, 4
    1578                            .dwcfa  0x07, 5
    1579                            .dwcfa  0x07, 6
    1580                            .dwcfa  0x07, 7
    1581                            .dwcfa  0x07, 8
    1582                            .dwcfa  0x07, 9
    1583                            .dwcfa  0x08, 10
    1584                            .dwcfa  0x08, 11
    1585                            .dwcfa  0x08, 12
    1586                            .dwcfa  0x08, 13
    1587                            .dwcfa  0x08, 14
    1588                            .dwcfa  0x08, 15
    1589                            .dwcfa  0x07, 16
    1590                            .dwcfa  0x07, 17
    1591                            .dwcfa  0x07, 18
    1592                            .dwcfa  0x07, 19
    1593                            .dwcfa  0x07, 20
    1594                            .dwcfa  0x07, 21
    1595                            .dwcfa  0x07, 22
    1596                            .dwcfa  0x07, 23
    1597                            .dwcfa  0x07, 24
    1598                            .dwcfa  0x07, 25
    1599                            .dwcfa  0x08, 26
    1600                            .dwcfa  0x08, 27
    1601                            .dwcfa  0x08, 28
    1602                            .dwcfa  0x08, 29
    1603                            .dwcfa  0x08, 30
    1604                            .dwcfa  0x08, 31
    1605                            .dwcfa  0x08, 32
    1606                            .dwcfa  0x07, 33
    1607                            .dwcfa  0x07, 34
    1608                            .dwcfa  0x07, 35
    1609                            .dwcfa  0x07, 36
    1610                            .dwcfa  0x07, 37
    1611                            .dwcfa  0x07, 38
    1612                            .dwcfa  0x07, 39
    1613                            .dwcfa  0x07, 40
    1614                            .dwcfa  0x07, 41
    1615                            .dwcfa  0x07, 42
    1616                            .dwcfa  0x07, 43
    1617                            .dwcfa  0x07, 44
    1618                            .dwcfa  0x07, 45
    1619                            .dwcfa  0x07, 46
